{
  "home": {
    "hello": "Hello, I'm",
    "name": "Yelyzaveta Stoliarchuk",
    "about": "I'm a front-end developer from Kyiv, Ukraine 🇺🇦",
    "projects-link": "view my projects",
    "projects-link-title": "Go to Projects page",
    "about-link": "more about me",
    "about-link-title": "Go to About page"
  },
  "menu": {
    "home": "Home",
    "projects": "Projects",
    "about": "About",
    "contact": "Contact"
  },
  "contact": {
    "title": "Let's get in touch!"
  },
  "about": {
    "title": "Hi, I am Yelyzaveta Stoliarchuk",
    "job": "Frontend Developer, based in Ukraine 🇺🇦",
    "content": "I am passionate web developer, currently studying Computer Science at Institute for Applied System Analysis Igor Sikorsky Kyiv Polytechnic Institute. In my spare time I enjoy reading sci-fi, drawing and launching new startups.",
    "certificates": "Featuring certificates achieved on learning platforms",
    "projects-link": "view my projects",
    "projects-link-title": "Go to Projects page",
    "view-certificate": "View certificate",
    "view-resume": "View my resume"
  },
  "months": {
    "1": "January",
    "2": "February",
    "3": "March",
    "4": "April",
    "5": "May",
    "6": "June",
    "7": "July",
    "8": "August",
    "9": "September",
    "10": "October",
    "11": "November",
    "12": "December"
  },
  "footer": {
    "main": "This website was coded by Yelyzaveta Stoliarchuk, and is ",
    "open-sourced": "open-sourced"
  },
  "pages": {
    "home": "Yelyzaveta Stoliarchuk",
    "projects": "Projects of Yelyzaveta Stoliarchuk",
    "about": "About Yelyzaveta Stoliarchuk",
    "contact": "Contact Yelyzaveta Stoliarchuk"
  },
  "projects": {
    "title": "Take a look at what I've been working on!",
    "launch-link": "Launch Project",
    "source-code-link": "Source Code",
    "weather-app": "The weather app is developed using HTML, CSS and Vanilla JS + API, AJAX. It features upper panel with Ukrainian cities and weather forecast for next 5 days on the bottom. User can switch the units of temperature between Celsius and Fahrenheit. There is a light and dark mode.",
    "yelp-camp-app": "YelpCamp is a full-stack, fully functional web application where people can submit campgrounds and users can review them. It was developed using Atlas MongoDB, combined with integration of cookies and sessions to improve user experience.",
    "notes-app-1": "Notes App is written in Vanilla JS. The app functionality provides user with ability of creating, deleting, editing, archiving and unarchiving notes. At the bottom of the page user can view the summary table, which shows counts of created notes.",
    "notes-app-2": "The new version is written using React framework with combination of Redux state management and Typescript. On additional branches you can view integration of Storybook and Tailwind. The API created with Node.js can be viewed here. On additional branches you can view implementation with Postgres, Sequelize ORM, Nest.js and Docker.",
    "news-portal": "This project was coded for journalist to use as portfolio, but with further scaling it can be used as a real news portal. It is written using React, Typescript and Tailwind CSS. The user can view recent news and posts on main page, open whole texts or search for older postings.",
    "behealthy": "Beheathy is the app that provides convenient communication between patiens and their family practitioners. It combines multiple features, such as applying to consultation, keeping track of weight and height, chat with doctors etc. It is coded using React, Redux Saga, Tailwind CSS, Docker, Postgres, Redis, i18next, Nest.js and others. I have been wotking on frontend implementation as well as with backend (creation of entities, database calls using Nest.js, Postgres and Sequelize ORM).",
    "behealthy-mobile": "During the internship I also worked on implementation of mobile version of the Behealthy project using React Native. My main tasks were adjusting/rewriting frontend and adjusting existing registration logic for mobile use."
  }
}
